app/Models/JobSearchModel.php

        public function search_data($search_data) {

            $this->search->select('job_post.*, industry.name')
                         ->join('industry', 'job_post.industry = industry.id', 'left');

            if ($search_data['search_job_title'] != '') {

                $this->search->like('title', $search_data['search_job_title'], 'both');

            }

            if ($search_data['industry'] != 0) {

                $this->search->where('industry.id', $search_data['industry']);

            }

            if ($search_data['job_function'] != 0) {

                $this->search->where('job_function', $search_data['job_function']);

            }

            if ($search_data['location'] != 0) {

                $this->search->where('location', $search_data['location']);

            }

            $query = $this->search->get();
---
SELECT `job_post`.*, `industry`.`name`
FROM `job_post`
LEFT JOIN `industry` ON `job_post`.`industry` = `industry`.`id`